# FieldDomainPointsByUV Class

---
Represents a set of two-dimensional point coordinates (defined usually on surface)
SystemObject Autodesk.Revit.DB.AnalysisFieldDomainPoints Autodesk.Revit.DB.AnalysisFieldDomainPointsByUV
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    public class FieldDomainPointsByUV : FieldDomainPoints

    Public Class FieldDomainPointsByUV
    	Inherits FieldDomainPoints

    public ref class FieldDomainPointsByUV : public FieldDomainPoints

    type FieldDomainPointsByUV =
        class
            inherit FieldDomainPoints
        end
The FieldDomainPointsByUV type exposes the following members.
| Name| Description
---|---|---
| FieldDomainPointsByUV(IListUV)| Initializes a new instance of the FieldDomainPointsByUV class
| FieldDomainPointsByUV(IListUV, ICollectionDouble, ICollectionDouble)| Initializes a new instance of the FieldDomainPointsByUV class
Top
| Name| Description
---|---|---
| IsValidObject|  Specifies whether the .NET object represents a valid Revit entity. (Inherited from FieldDomainPoints)
Top
| Name| Description
---|---|---
| Dispose| (Inherited from FieldDomainPoints)
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetType| Gets the Type of the current instance.(Inherited from Object)
| SetGridCoordinates|
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.DB.Analysis Namespace